//p – характеристика простого поля, над которым определяется эллиптическая кривая
#define P "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFD97"
//(u,v) – координаты точки P при эквивалентном представлении в форме скрученной кривой Эдвардса
#define V "60CA1E32AA475B348488C38FAB07649CE7EF8DBE87F22E81F92B2592DBA300E7"
//q – порядок подгруппы простого порядка группы точек эллиптической кривой
#define Q "400000000000000000000000000000000FD8CDDFC87B6635C115AF556C360C67"
//e, d – коэффициенты эквивалентной скрученной эллиптической кривой в форме Эдвардса
#define D "605F6B7C183FA81578BC39CFAD518132B9DF62897009AF7E522C32D6DC7BFFB"
#define E "1"
//Степень
#define MAX "1000000000000000000000000000000000000000000000000000000000000000000"
